---
layout: default
title: 数据库事物隔离级别
comments: true
---

## 事务的基本特性：

> * Atomic原子性：事务中包含的操作被看做一个逻辑单元，这个逻辑单元中的操作要
    么全部成功，要么全部失败。

> * Consistency一致性：只有合法的数据可以被写入数据库，否则事务应该将其回滚到最初
   状态。

> * Isolation隔离性：事务允许多个用户对同一个数据进行并发访问，而不破坏数据的正
   确性和完整性。同时，并行事务的修改必须与其他并行事务的修改相互独立。

> * Durability持久性：事务结束后，事务处理的结果必须能够得到固化。

## 事务并发执行时会出现以下几种异常情况：

> * Lost update（丢失更新）：撤销一个事务时，导致其他已经提交的数据被覆盖。
> * Dirty Reads（脏读）：一个事务读到另一事务未提交的更新数据。
> * Non-repeatable Reads（不可重复读）：一个事务读到另一事务已提交的更新数据。
> * Second lost updates problem（第二丢失更新）：这是不可重复读中的特例，一个事务覆盖另一事务已提交的更新数据。
> * Phantom Reads（幻读）：对于两个事务T1，T2，T1从一个表中读取了一个字段，然后T2在该表中插入了一些新的行。之后T1再读取同一个表，就会多出几行。

## 数据库隔离级别：


## 隔离级别与并发性能的关系：

## 总结：

> * 数据库隔离级别越高，并发性能越低

> * 一般工程应用中，MySQL数据库隔离级别默认设置为：Repeatable read。(查看默认设置的SQL：select @@tx_isolation;  修改隔离级别SQL： set        transaction isolation level read committed;)

P.S. 在实际应用中，由于对并发性能要求很高，绝大部分情况不会动用事物来对数据库进行操作，那么问题来了，如何保证事物的4大原则呢？答：一般都会将事物处理转化成业务逻辑代码来实现。
